benchmark/k6/results/OCI_StressTest_RandomPL_2025-02-25T11:20:00.log
Execution Setup
{
  "testName": "OCI_StressTest_RandomPL",
  "host": "129.150.50.242",
  "options": {
    "insecureSkipTLSVerify": true,
    "stages": [
      {
        "duration": "30s",
        "target": 100
      },
      {
        "duration": "1m",
        "target": 100
      },
      {
        "duration": "30s",
        "target": 300
      },
      {
        "duration": "1m",
        "target": 300
      },
      {
        "duration": "30s",
        "target": 500
      },
      {
        "duration": "3m",
        "target": 500
      },
      {
        "duration": "30s",
        "target": 700
      },
      {
        "duration": "1m",
        "target": 700
      },
      {
        "duration": "20s",
        "target": 0
      }
    ]
  },
  "multiplier": [
    2,
    3,
    4,
    5,
    6,
    7,
    8,
    9,
    10,
    15,
    20,
    30,
    40,
    50,
    70,
    95
  ],
  "text": "In an era defined by rapid innovation and global interconnectivity, humanity finds itself at the crossroads of technology and tradition. Modern advancements in computing, medicine, and environmental science have redefined possibilities, enabling breakthroughs once thought impossible. As digital networks weave communities together, ethical debates and sustainable practices emerge as critical priorities. Scholars, engineers, and policymakers collaborate to harness artificial intelligence and renewable energy, ensuring progress benefits society at large. Cultural heritage and scientific discovery now coexist in a delicate balance, challenging us to honor the past while forging new paths. Every discovery, from quantum computing to gene editing, invites both excitement and caution, urging responsible innovation and shared wisdom for a brighter future. With each milestone, the narrative of progress deepens, inspiring a commitment to knowledge, empathy, and perseverance that transcends borders and generations. This comprehensive journey through scientific and cultural evolution illustrates how collective effort and visionary thinking drive society forward. The integration of diverse perspectives fosters innovation, while respect for natural systems ensures that progress remains sustainable and inclusive. As challenges arise and new opportunities emerge, the interplay between technology and human values continues to shape our shared destiny, reminding us that every step forward is a testament to our capacity for adaptation and hope.",
  "sleep": 1
}

----------------------------------------

Running gRPC Auto Migration via Framework...
         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 
     execution: local
        script: grpc-auto-test.js
        output: -
     scenarios: (100.00%) 1 scenario, 700 max VUs, 8m50s max duration (incl. graceful stop):
              * default: Up to 700 looping VUs for 8m20s over 9 stages (gracefulRampDown: 30s, gracefulStop: 30s)
     ✓ status is OK
     checks...............: 100.00% 32739 out of 32739
     data_received........: 1.2 GB  2.3 MB/s
     data_sent............: 62 MB   119 kB/s
     grpc_req_duration....: avg=2.18s min=175.48ms med=1.13s max=1m37s p(90)=5.12s  p(95)=7.64s 
     iteration_duration...: avg=6.25s min=1.52s    med=4.03s max=1m52s p(90)=13.14s p(95)=21.47s
     iterations...........: 32745   62.614466/s
     vus..................: 1       min=1              max=700
     vus_max..............: 700     min=700            max=700
----------------------------------------

Running gRPC Manual Migration...
         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 
     execution: local
        script: grpc-manual-test.js
        output: -
     scenarios: (100.00%) 1 scenario, 700 max VUs, 8m50s max duration (incl. graceful stop):
              * default: Up to 700 looping VUs for 8m20s over 9 stages (gracefulRampDown: 30s, gracefulStop: 30s)
     ✗ status is OK
      ↳  99% — ✓ 34622 / ✗ 1
     checks...............: 99.99% 34622 out of 34623
     data_received........: 1.3 GB 2.5 MB/s
     data_sent............: 66 MB  128 kB/s
     grpc_req_duration....: avg=1.95s min=177.39ms med=1.22s max=1m11s p(90)=4.4s   p(95)=5.83s 
     iteration_duration...: avg=5.87s min=1.52s    med=4.13s max=1m15s p(90)=10.56s p(95)=15.87s
     iterations...........: 34627  67.649402/s
     vus..................: 1      min=1              max=700
     vus_max..............: 700    min=700            max=700
----------------------------------------

Running HTTP REST Existing API...
         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 
     execution: local
        script: http-test.js
        output: -
     scenarios: (100.00%) 1 scenario, 700 max VUs, 8m50s max duration (incl. graceful stop):
              * default: Up to 700 looping VUs for 8m20s over 9 stages (gracefulRampDown: 30s, gracefulStop: 30s)
     ✗ status is 200
      ↳  99% — ✓ 42792 / ✗ 20
     checks.........................: 99.95% 42792 out of 42812
     data_received..................: 1.6 GB 2.9 MB/s
     data_sent......................: 74 MB  140 kB/s
     http_req_blocked...............: avg=17.99ms min=867ns    med=3.49µs   max=4.2s     p(90)=5.49µs  p(95)=8.42µs 
     http_req_connecting............: avg=17.99ms min=0s       med=0s       max=4.2s     p(90)=0s      p(95)=0s     
     http_req_duration..............: avg=3.72s   min=169.88ms med=2.03s    max=1m0s     p(90)=8.48s   p(95)=12.28s 
       { expected_response:true }...: avg=3.7s    min=169.88ms med=2.03s    max=59.27s   p(90)=8.46s   p(95)=12.22s 
     http_req_failed................: 0.04%  20 out of 42812
     http_req_receiving.............: avg=2.65s   min=9.07µs   med=820.22ms max=59.26s   p(90)=7.12s   p(95)=10.91s 
     http_req_sending...............: avg=13.48µs min=2.77µs   med=11µs     max=630.89µs p(90)=19.63µs p(95)=26.34µs
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s       max=0s       p(90)=0s      p(95)=0s     
     http_req_waiting...............: avg=1.06s   min=167.36ms med=981.52ms max=37.55s   p(90)=2.17s   p(95)=2.56s  
     http_reqs......................: 42812  81.238361/s
     iteration_duration.............: avg=4.74s   min=1.17s    med=3.07s    max=1m1s     p(90)=9.52s   p(95)=13.31s 
     iterations.....................: 42811  81.236464/s
     vus............................: 1      min=1              max=700
     vus_max........................: 700    min=700            max=700
----------------------------------------

All tests completed. See 'results/OCI_StressTest_RandomPL_2025-02-25T11:20:00.log' for details.